package com.skyon.common.enums;

/**
 * 流程编号
 */
public enum WfCode {
    WF1101("人工录入信号流程-客户经理经办模式"),
    WF1102("人工录入信号流程-分行风险监测岗(零售)经办模式"),
    WF1103("人工录入信号流程-总行风险监测岗(零售)经办模式"),
    WF1104("人工录入信号流程-分行风险监测岗(合作方)"),
    WF1105("人工录入信号流程-总行风险监测岗(合作方)"),
    WF2101("预警任务审核流程-自营业务"),
    WF2102("预警任务审核流程-非自营业务"),
    WF2103("预警任务审核流程-合作方业务"),
    WF2104("预警任务审核流程-信号异议模式"),
    WF3101("名单管理审核流程-风险名单预警解除"),
    RETAIL_WF3102("名单管理审核流程-灰名单管理"),
    RETAIL_WF3103("名单管理审核流程-黑名单管理"),
    RETAIL_WF3104("名单管理审核流程-合作方高风险名单退出"),



    WF1001("人工录入信号流程-金融市场部业务"),
    WF1002("人工录入信号流程-投行资管业务(总行处理模式)"),
    WF1003("人工录入信号流程-投行资管业务(分行处理模式)"),
    WF2001("预警任务审核流程-对公客户预警认定"),
    WF2011("预警任务审核流程-对公客户处置跟踪"),
    WF2002("预警任务审核流程-同业主体预警认定(分行)"),
    WF2012("预警任务审核流程-同业主体处置跟踪(分行)"),
    WF2003("预警任务审核流程-同业主体预警认定(总行)"),
    WF2013("预警任务审核流程-同业主体处置跟踪(总行)"),
    WF2004("预警任务审核流程-金融市场投组预警认定(总行)"),
    WF2014("预警任务审核流程-金融市场投组处置跟踪(总行)"),
    WF2005("预警任务审核流程-投行资管投组预警认定(总行)"),
    WF2015("预警任务审核流程-投行资管投组处置跟踪(总行)"),
    WF2006("预警任务审核流程-金融市场投组预警认定(分行)"),
    WF2016("预警任务审核流程-金融市场投组处置跟踪(分行)"),
    WF2007("预警任务审核流程-投行资管投组预警认定(分行)"),
    WF2017("预警任务审核流程-投行资管投组处置跟踪(分行)"),
    WF3001("名单管理审核流程-风险名单预警解除支行经办模式"),
    WF3002("名单管理审核流程-风险名单(同业)预警解除分行经办模式"),
    WF3003("名单管理审核流程-风险名单(同业)预警解除总行经办模式"),
    PEER_WF3102("名单管理审核流程-灰名单管理"),
    PEER_WF3103("名单管理审核流程-黑名单管理"),
    PEER_WF3104("名单管理审核流程-合作方高风险名单退出");


    WfCode(String info) {
        this.info = info;
    }

    private final String info;


    public String getInfo() {
        return info;
    }
}
